#+TITLE: Tufte Org Mode
#+AUTHOR: Thomas S. Dye
#+FULLNAME: Thomas Stuart Dye
#+PUBLISHER: Tufte Org Mode Press
#+PRINT-DATE: March 2016
#+COPYRIGHT-DATE: 2015
#+WEB-SITE: http://www.tsdye.com
#+MARGIN-NOTE-FONT: \itshape\footnotesize
#+LATEX_CLASS: tufte-book

**** Link for a command with one option
The option is placed after a ; in the link description.
#+name: latex-opt-link
#+begin_src emacs-lisp
(org-add-link-type
 "latex-opt" nil
 (lambda (path desc format)
   (when (eq format 'latex)
     (let* ((desc-list (split-string desc ";"))
            (opt (nth 1 desc-list))
            (arg (nth 0 desc-list)))
       (format "\\%s%s{%s}" path
               (if (equal "" opt) opt (format "[%s]" opt))
               arg)))))
#+end_src

#+results: latex-opt-link
| lambda | (path desc format) | (when (eq format (quote latex)) (let* ((desc-list (split-string desc ;)) (opt (nth 1 desc-list)) (arg (nth 0 desc-list))) (format \%s%s{%s} path (if (equal  opt) opt (format [%s] opt)) arg))) |

